{
	"name" : "Custom Boxes per Gioxx's Wall",
	"slug" : "wp-gwcustomboxes",
	"author" : "<a href='https://gioxx.org'>Gioxx</a>",
	"author_profile" : "https://profiles.wordpress.org/gioxx",
    	"donate_link" : "https://ko-fi.com/gioxx",
	"version" : "0.25",
	"download_url" : "https://github.com/gioxx/wp-gwcustomboxes/releases/download/0.25/wp-gwcustomboxes.zip",
	"requires" : "6.2",
	"tested" : "6.4.1",
	"requires_php" : "8.0",
    	"added" : "2015-09-02 00:00:00",
	"last_updated" : "2023-12-04 09:30:00",
    	"homepage" : "https://gioxx.org",
	"sections" : {
		"description" : "Box personalizzati che compaiono negli articoli di Gioxx's Wall: pillole, banco prova e molto altro ancora.",
		"installation" : "Un clic sul pulsante di attivazione e il gioco è fatto.",
		"changelog" : "<h4>04/12/23</h4><ul><li>Improve: modifico il comportamento del box \"Sponsored\" per specificare che tipo di sponsorizzazione si applica all'articolo (come già faccio per il Banco Prova).</li></ul><h4>23/11/23</h4><ul><li>Change: semplici fix estetici (testo).</li></ul><h4>17/5/23 (Preview5)</h4><ul><li>Bugfix: metto a posto i problemi generati dal rilevamento dei campi personalizzati degli articoli.</li><li>Change: rimuovo completamente i riferimenti ai progetti sponsorizzati (pulizia codice, non più utile).</li></ul><h4>17/5/23 (Preview4)</h4><ul><li>Improvement: aggiungo icona personalizzata per il plugin.</li></ul><h4>17/5/23 (Preview3)</h4><ul><li>Improvement: completo migrazione a funzione \"boxSelection\".</li><li>Change: elimino il file di changelog vecchio (CHANGELOG.MD) e migro tutto il contenuto in questo JSON informativo.</li></ul><h4>17/5/23 (Preview2)</h4><ul><li>Bugfix: Metto a posto JSON riepilogativo.</li><li>Bugfix: correggo problema blocco proposto in ogni \"content\" (abbandono l'idea della funzione dedicata, ne comincio a fare una unica per tutti i blocchi (htmlContent)).</li></ul><h4>17/5/23 (Preview1)</h4><ul><li>Change: Aggiornamenti automatici integrati con il rilascio via Github.</li><li>Improvement: Pulizia e ottimizzazione codice.</li><li>Immagine di copertina di <a href=\"https://unsplash.com/@erdaest?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Erda Estremera</a> su <a href=\"https://unsplash.com/it/foto/sxNt9g77PE0?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\">Unsplash</a>.</li></ul><h4>8/12/20</h4><ul><li>ho spostato l'icona del blocco articolo non aggiornato di recente.</li></ul><h4>22/11/20</h4><ul><li>nuovo blocco per aggiornamento dell'articolo.</li></ul><h4>21/11/20</h4><ul><li>rifacimento completo della grafica dei custom boxes.</li></ul><h4>7/11/20</h4><ul><li>modifico il box del banco prova per essere un po' meno invadente rispetto al passato, più compatto. Me gusta, lo applico a tutti tranne al blocco di attenzione per contenuto \"vecchio\", porto quindi la versione del plugin CustomBoxes alla 0.6.</li></ul><h4>8/5/20</h4><ul><li>carico qui dentro JavaScript per la chiusura box custom.</li></ul><h4>19/4/20</h4><ul><li>modifico icona pillole.</li></ul><h4>17/4/20</h4><ul><li>il riconoscimento dell'articolo \"sponsored\" passa sotto categoria dedicata, modifico quindi has_tag con has_category. Modifico anche class=\"titolo_custombox\" per i titoli dei ox alert.</li></ul><h4>9/4/20</h4><ul><li>corretti i custom boxes per integrare i tag p mancanti.</li></ul><h4>23/9/19</h4><ul><li>leggera modifica del blocco Sponsored nel caso di richiesta esplicita di modifica articolo.</li></ul><h4>25/6/19</h4><ul><li>tutti gli URL immagini diretti sono stati sostituiti con quelli gestiti da WordPress Media.</li></ul><h4>19/6/19</h4><ul><li>modifico blocco Android's Corner e metto a posto i tag ALT non corretti.</li></ul><h4>20/3/19</h4><ul><li>aggiungo \"A piccoli passi\" (blocco articoli con tag).</li></ul><h4>11/10/18</h4><ul><li>ho azzerato le modifiche tra is_archive, is_home e is_single per i box custom, tutti in fondo all'articolo (per evitare problemi nelle anteprime nei box di Sidebar), rimesso ano anche all'indentazione codice e spaziature.</li></ul><h4>4/10/18</h4><ul><li>ho spostato la posizione dei Custom Boxes Pillole.</li></ul><h4>17/9/18</h4><ul><li>ho spostato la posizione dei Custom Boxes Android / Sponsorizzato / Consigli per gli acquisti.</li></ul><h4>16/9/18</h4><ul><li>modifica del blocco Sponsored (autore sottoscritto o ospite di vecchia data), includo icona FontAwesome per indicare il contenuto sponsorizzato.</li></ul><h4>19/6/18</h4><ul><li>pura modifica estetica del box Pillole.</li></ul><h4>17/6/18</h4><ul><li>aggiungo il Blocco Prodotto anche per il Banco Prova Console.</li></ul><h4>8/6/18</h4><ul><li>migrato a nuovo AlertBox le Pillole.</li></ul><h4>2/6/18</h4><ul><li>migrato a nuovo AlertBox OldPost. Pulizia codice non più usato.</li></ul><h4>22/5/18</h4><ul><li>migrato a nuovo AlertBox MRL + Disclaimer #BancoProva.</li></ul><h4>20/5/18</h4><ul><li>modificato box sponsored post per presentare a video il nuovo AlertBox.</li></ul><h4>15/1/18</h4><ul><li>class \"bancoprova\" nei div dei test su strada, per intercettarlo e pulirlo dalla Telegram Instant View. Modificato puntamento immagine e sostituito con thumb Fighorse150x150.pg.</li></ul><h4>11/1/18</h4><ul><li>modificato \"i miei pensieri\" con \"le mie opinioni\" nel blocco disclaimer del banco prova.</li></ul><h4>23/10/17</h4><ul><li>ho modificato un dettaglio sul caricamento immagine di Mario per il box pillole.</li></ul><h4>20/10/17</h4><ul><li>ho provato a giocare con il blocco donazione PayPal.me, mi fa schifo, ciao e grazie per il pesce.</li></ul><h4>3/3/17</h4><ul><li>puntamenti a HTTPS.</li></ul><h4>20/12/16</h4><ul><li>ho modificato le categorie legate al progetto sponsorizzato e ai singoli post sponsorizzati, rifatto anche il div dello Sponsored post, utilizzo il nuovo wrapper.</li></ul><h4>11/7/16</h4><ul><li>ho modificato una sola parola nel box materiale sponsorizzato.</li></ul><h4>13/6/16</h4><ul><li>includo nuovo box per materiale sponsorizzato (se rimane a me, viene restituito o comprato di tasca mia).</li></ul><h4>4/4/16</h4><ul><li>il logo dello sponsor (progetto sponsorizzato) può avere al massimo un width di 250px.</li></ul><h4>18/3/16</h4><ul><li>modificato il blocco della vecchia pubblicazione. L'ho spostato in coda perché modifica anche il contenuto della sidebar e viene fuori una schifezza agli occhi dei lettori.</li></ul><h4>15/2/16</h4><ul><li>inserito blocco Press Start Milano.</li></ul><h4>30/11/15</h4><ul><li>corretto errore URL recensione VF Smart Ultra 6.</li></ul><h4>1/11/15</h4><ul><li>corretti errori su blocco VF Smart Ultra 6.</li></ul><h4>28/10/15</h4><ul><li>completate informazioni VF Smart Ultra 6.</li></ul><h4>6/10/15</h4><ul><li>messo a posto blocco Xperia Z2, creato blocco per VF Smart Ultra 6.</li></ul><h4>2/9/15</h4><ul><li>inseriti i controlli di presenza variabili per i Progetti Sponsorizzati, rimosso blocco di TimeRepublik.</li></ul>"
	},
	"banners" : {
		"low" : "https://gioxx.github.io/wp-gwcustomboxes/img/banner-772x250.jpg",
		"high" : "https://gioxx.github.io/wp-gwcustomboxes/img/banner-1544x500.jpg"
	}
}
